//สร้าง function และกำหนดค่าแปรในการเก็บข้อมูล
function R1() {
 var h = "CBR 1000 RR" 
 var p1 ="CBR1000RR นั้นใช้เครื่องยนต์ขนาด 999 ซีซี 4 สูบ 16 วาล์ว DOHC ระบายความร้อนด้วยน้ำ โดยมีขนาดกระบอกสูบและช่วงชักอยู่ที่ 76.0 x 55.1mm กำลังแรงอัดอยู่ที่ 12.3:1 จ่ายน้ำมันด้วยระบบหัวฉีด มีกำลัง 117 แรงม้า (ถูกล้อคม้าไว้) จับคู่เกียร์อัตโนมัติ 6 สปีด ระบบกันสะเทือนเป็นโช้คอัพเทเลสโคปิก ด้านหลังเป็นสวิงอาร์มปรับระดับได้จาก โชวะ (Showa) ตอบสนองทุกการขับขี่อย่างนุ่มนวลและแม่นยำ ระบบเบรกล้อหน้าเป็นดิสก์เบรกคู่ ล้อหลังเป็นแบบเดี่ยว นอกจากนี้ ยังมีระบบช่วยขับขี่มาให้ครบครัน ทั้ง C-ABS (ดิสก์เบรกหน้าขนาด 320 mm ดิสก์เบรกหลังขนาด 220 mm) ช่วยให้การเบรกทำได้ปลอดภัย และระบบกันสะบัดไฟฟ้า HESD ช่วยปรับความแข็งของแฮนด์ ให้การบังคับแม่นยำทุกย่านความเร็ว ขนาดของยางหน้า-หลังอยู่ที่ 120/70, 190/50 ถังน้ำมันจุอยู่ 17.5 ลิตร"
// ทำการส่งค่าในตัวแปรไปยัง element ที่กำหนด
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;

}
//การทำงานที่เหลือเป็นการทำงานเหมือนกันกับด้านบนจึงขออนุญาติอธิบายเพียงด้านบนนะครับ
function R2() {
 var h = "CB 1000" 
 var p1 ="CB 1000R ใช้เครื่องยนต์แบบหัวฉีด PGM-FI ขนาด 998cc 4 สูบ DOHC ระบายความร้อนด้วยหม้อน้ำและพัดลมไฟฟ้า ให้แรงม้ามาอยู่ที่ 92kW @ 10,000rpm ส่วนทอร์คนั้นอยู่ที่ 99Nm @ 7,750rpm กระบอกสูบ x ระยะช่วงชักเท่ากับ 75 x 56.5 มม. มีกำลังอัดอยู่ที่ 11.2 : 1 ส่งกำลังด้วยระบบเกียร์ 6 สปีด ใช้คลัทช์เปียกแบบไฮดรอลิก ขับเคลื่อนด้วยโซ่เสอตร์ มองจากสเปคตรงนี้แล้วถือว่าค่อนข้างจะหายห่วงในเรื่องกำลังในการบิด น่าจะจัดจ้านกันมากเลยทีเดียว"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;

}

function R3() {
 var h = "CBR 650 F" 
 var p1 ="CBR 650 F ส่วนแรกที่จะกล่าวถึงก็คือแผงหน้าปัดที่มีรูปลักษณ์โมเดิร์นจากการใช้ทรงกลมผสานกับตัวเลขดิจิตอลมองแล้วให้ความรู้สึกได้ถึงสไตล์อันโฉบเฉี่ยวและทันสมัย ราวกับรถบิ๊กไบค์แห่งโลกอนาคตเลยทีเดียว สำหรับสมรรถนะของบิ๊กไบค์ที่น่าสนใจที่สุดอย่าง Honda CBR650F ก็นับว่าดีเยี่ยมด้วยเสียงคำรามจากเครื่องยนต์ที่จะสะท้านไปในหัวใจของสิงห์นักบิด ยามที่ความเร็วรอบคือ 7,000 รอบต่อนาที ยิ่งเสียงเครื่องดังเท่าไรก็ยิ่งทำให้ผู้ขับขี่สัมผัสความเร็วได้มากยิ่งขึ้น หากคุณเป็นผู้ที่ชื่นชอบการขับขี่รถมอเตอร์ไซค์โดยไม่ต้องเสี่ยงกับการยึดใบขับขี่ รถมอเตอร์ไซค์ Honda CBR650F คันนี้ก็มีระดับพลังที่จะทำให้นักบิดขับขี่แบบแอดเวนเจอร์ได้อย่างปลอดภัยไม่ต้องเกรงว่าจะโดนใบสั่ง"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;

}
function R4() {
 var h = "CB 650 F" 
 var p1 ="CB 650 F เจ้ารถคันนี้เป็นบิ๊กไบค์ที่ใช้ความจุเครื่องขนาด 649cc ซึ่งมีไม่บ่อยนักที่ทางค่ายฮอนด้าจะให้ความจุมาใกล้เคียงกับชื่อรุ่น (650) จริงๆ อย่างนี้ ส่วนมากจะมีช่องว่างพอสมควรระหว่างชื่อรุ่นกับจำนวนซีซีจริงๆ ในรุ่นอื่นๆ ตัว CB650F นั้นมีจำนวน 16 วาล์ว 4 สูบ เป็นรถที่เน้นในการขับขี่ในเมืองเป็นหลักตามจุดประสงค์ในการออกแบบรถที่เปลือยแฟร์ริ่งและยกแฮนด์บาร์ขึ้นมาให้สูงพอเหมาะกับท่านั่งที่ไม่ต้องก้มหลังมาก ซึ่งรถ CB650F คันนี้ก็ต้องถือว่าเป็นสายพันธ์ที่ต่อยอดมาจากตระกูล CB400F และ Hornet ในสมัยก่อน และเมื่อพิจารณาถึงเครื่องยนต์ขนาด 649cc ที่มาพร้อมกับจำนวน 4 สูบนั้นเห็นได้ชัดว่ามันจะส่งกำลังได้เต็มที่ตั้งแต่ในความเร็วปานกลางจนถึงความเร็วสูงๆ เป็นอย่างดี"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function R5() {
 var h = "CB 500 F" 
 var p1 ="CB 500 F CB500F ขับเคลื่อนด้วยเครื่องยนต์ใหม่ DOHC สองสูบมาพร้อมกับ ข้อเหวี่ยง 180 องศา ขนาด 500 cc ระบายความร้อนด้วยน้ำ สี่วาล์วต่อสูบ ขนาดกระบอกสูบและช่วงชักเกือบจะเป็นสี่เหลี่ยมจตุรัสอยู่ที่ 67.0 x 66.8 มิลลิเมตร เครื่องยนต์แบบหัวฉีด PGM-FI ผ่านปีกผีเสื้อแบบคู่ขนาด 34 มิลลิเมตร ซึ่งทาง Honda ยังไม่ได้ระบุเกี่ยวกับแรงม้า แต่คาดว่าจะอยู่ช่วงเดียวกับล้อขนาด 50 ครับเบาะสูงเพียง 30.9 นิ้ว ซึ่งสามารถทำให้ผู้ขับขี่ขับขี่ได้สบาย และรุ่น F นี้ค่อนข้างเบาเพียง 420 ปอนด์ หรือ 190 กิโลกรัมเท่านั้น (แบบน้ำมันเต็มถัง) ซึ่งเบามากถ้าเทียบกับรุ่น 500 cc ของยี่ห้ออื่น และจะทำให้ควบคุมได้ง่าย ทาง honda ยังไม่ได้ประกาศเกี่ยวกับอัตราการใช้น้ำมัน แต่น่าจะเชื่อได้ว่า Honda คงเน้นเรื่องการประหยัดน้ำมันเป็นพิเศษอยู่พอสมควรครับ"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function y1() {
 var h = "YZF-R1" 
 var p1 ="  ระบบช่วงล่างของ R1 มาพร้อมโช๊คอัพยี่ห้อ Yayaba (คายาบ้า) ส่วน Yamaha YZR-M1 เป็นโช๊ค Öhlins ทั้งด้านหน้า-หลัง ที่จัดเต็มด้วยระบบ Öhlins Electronic Racing Suspension (ERS) ที่มีความพิเศษในการรับข้อมูลจาก IMU 6-แกน(วัดข้อมูลออกมาเป็น 3 มิติ) เพื่อนำมาประมวลผลปรับระยะยุบตัวของโช๊คเพื่อให้เกิดความแม่นยำที่สุดแถมยังช่วยให้ระบบเบรคทำงานได้อย่างเต็มประสิทธิภาพอีกด้วย ซึ่งถือเป็นอีกหนึ่งเทคโนโลยีในระดับ MotorGP เลยทีเดียวด้านเครื่องยนต์เป็นแบบ 4 สูบเรียง Crossplane CP4 ขนาดความจุ 998 cc มีการใช้การจุดระเบิดแบบ รถแข่ง M1 ของทาง Yamaha ที่มีแรงบิดออกมาอย่างต่อเนื่องสม่ำเสมอ ลูกสูบแบบ Forged Alluminum, เพลาข้อเหวี่ยงแบบไทเทเนียม, กระเดื่องกดวาล์วที่มีการออกแบบใหม่ นอกจากนี้ห้องเผาไหม้มีอัตราส่วนกำลังอัดที่ 13:1 ส่งผลให้ Yamaha R1 และ Yamaha R1M มีแรงม้าที่ 200 แรงม้า"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function y2() {
 var h = "FZ1" 
 var p1 ="Yamaha FZ1 เจ้าบิ๊กไบค์รุ่นนี้ ออกแบบมาให้ใช้ประเภทน้ำมันเชื้อเพลิง เบนซิน 91, แก๊สโซฮอล 95 (E10), แก๊สโซฮอล 91 ที่ได้ใช้ระบบจ่ายน้ำมันเชื้อเพลิง หัวฉีด พร้อมทั้งสามารถจุน้ำมันได้ถึง 18ลิตร แรงด้วยพลังแบบ Liquid Cooled, 4-stroke, DOHC, 5-valve ที่ให้ปริมาตรกระบอกสูบที่ 998cc มีช่วงการชักที่ 77.0 x 53.6 mm มีอัตราการอัดที่ 11.5 : 1 แรงโดนใจด้วยกำลังสูงสุดที่ 150 PS/11,000 rpm โดยมีแรงบิดที่ 106 Nm/ 8,000 rpm สตาร์ทง่ายด้วยระบบการสตาร์ทแบบ Electric ทำให้เจ้าเครื่องยนต์สี่กระบอกสูบแถวเรียงคันนี้ ทำงานได้อย่างง่ายดาย สนุกทุกจังหวะด้วยระบบเกียร์แบบ Constant mesh, 6-speed ที่ออกแบบมาให้ผสานการทำงานกับ Wet, multiple-disc ให้ทำงานได้อย่างยอดเยี่ยม - See more at: http://th-bigbike.com/yamaha-fz1/#sthash.dgnRFPqH.dpuf"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function y3() {
 var h = "FZ-09" 
 var p1 ="Yamaha FZ-09 ได้รับการออกแบบมาอย่างพิถีพิถัน ถึงแม้จะเป็นรถที่หน้าตาดุดัน แต่งานประกอบและวัสดุแข็งแรงเนี๊ยบ ได้มาตรฐาน ตอบสนองต่อการขับขี่ทุกสถานะการณ์ ด้วยแรงบิดเร้าใจจากเครื่องยนต์ 4 จังหวะ 3 สูบ 847 cc. DOHC 12 วาล์ว ออกแบบด้วยแนวคิด Crossplane Crankshaft Concept ด้วยแรงม้าสูงสุดถึง 115 แรงม้าที่ 10,000 รอบ/นาที พร้อมยังสามารถปรับโหมดการขับขี่ให้เหมาะสมกับสภาพถนนได้ 3 แบบ"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function y4() {
 var h = "Bolt R " 
 var p1 ="Yamaha Bolt R มอเตอร์ไซค์สไตล์คลาสสิคจากค่าย Yamaha กับการออกแบบที่ให้กลิ่นอายของความคลาสสิคไฟหน้าทรงกลม เบาะนั่งสองที่เหมาะที่จะพาคนรู้ใจซ้อนท้ายขับไปชิวๆ  ท่อไอเสียสีเข้มเข้ากับบอดี้ ไฟท้ายคลาสสิค  การจัดวางเครื่องยนต์ดูสวยงาม น้ำหนักประมาณ 247.5kg ตัวรถสามารถนำไปตกแต่งเพิ่มเติมได้อีกหลากหลายแบบ Yamaha Bolt Rปริมาตรกระบอกสูบ(cc) 942.00ระบบส่งกำลัง (ระบบเกียร์) 5-speedระบบสตาร์ท Electricกม./ลิตร(km / L) -ความจุถังน้ำมันเชื้อเพลิง(cc) 12.น้ำหนัก(kg) 247.0 L*W*H(mm) 2,290 x 830 x   1,120ประเภท บิ๊กไบค์, รถครูสเซอร์-ชอปเปอร์"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function y5() {
 var h = "YZF-r3" 
 var p1 ="YZF-r3 ใช้เครื่องยนต์ 2 สูบ ขนาด 321 ซีซี ให้กำลัง 42 แรงม้า แรงบิด 29.6 นิวตันเมตร เกียร์ 6 สปีด ระบบเบรกเป็นดิสก์เบรกเดียวทั้งล้อหน้าและล้อหลัง โช้คด้านหน้าเป็นโช้คอัพแบบเทเลสโคปิก ส่วนด้านหลังเป็นสวิงอาร์มเดี่ยวสเปกอย่างเป็นทางการของ Yamaha R3 มีดังนี้ครับ เครื่องยนต์ขนาด 320.6cc 4 จังหวะ 2 สูบ DOHC 4 วาล์วต่อสูบ ระบายความร้อนด้วยน้ำ แรงอัดอยู่ที่ 11.2 : 1 ขนาดกระบอกสูบ x ช่วงชัก = 68.0 x 44.1mm (เสื้อสูบแบบไดอะซิลและลูกสูบแบบอัดขึ้นรูป) ทอร์คอยู่ที่ 29 NM ที่ 9000 รอบ แรงม้าให้มามากถึง 42 ตัว จ่ายน้ำมันแบบหัวฉีด ระบบจุดระเบิดแบบ TCI คลัทช์เปียก สตาร์ทไฟฟ้า ขับเคลื่อนด้วยระบบเกียร์ 6 สปีด และใช้ระบบเบรกหน้า-หลังแบบ ABS กับราคา 185,000 บาทนั้นถือว่าไม่แพงเลย"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function k1() {
 var h = "H2r" 
 var p1 ="H2 จะใช้เครื่องยนต์ 4 สูบเรียง ความจุ 1,043cc Centrifugal Supercharger (Superchager ที่ใช้สายพานไปปั่นแกนเทอร์โบ) สามารถสร้างกำลังได้ถึง 222 แรงม้า แต่ทว่าสเป็กที่เปิดเผยออกมานั่น อยู่ที่ 998cc พ่วงระบบ Centrifugal Supercharger ที่สามารถช่วยปั่นแรงม้าได้บ้าระห่ำถึง 300 ตัวอย่างไรก็ตาม Ninja H2R นี้ มันคงยังไม่ใช่ตัว Road Version ที่จะนำมาขายกัน คงต้องรอติดตามกันที่งาน EICMA 2014 อีกครั้ง สำหรับ Road Version ที่จะมากับพละกำลังที่น้อยกว่านี้ และดูเป็นรถโฉม Production ใช้งานจริงมากกว่านี้"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function k2() {
 var h = "Z1000" 
 var p1 ="เรามาเริ่มต้นกันเลยที่ขนาดของเครื่องยนต์ขับส่งกำลังที่มีขนาด 1,043 ซีซีแบบสี่สูบเรียง ได้มีการปรับแต่งเพื่อเพิ่มแรงบิตในช่วงกลางและช่วงปลายให้มีกำลังที่มากขึ้น ด้วยแคมชาฟ์ทใหม่ที่ยกสูงขึ้นมากกว่ารุ่นเดิม 0.3 มม. และองศาจุดระเบิดน้อยลงกว่าเดิม 6 องศาพร้อมกล่องอากาศที่ปรับปรุงใหม่  ระบบกล่อง ECU ที่ได้รับการปรับปรุง พร้อมรายละเอียดอื่นๆ อีกหลายรายการที่เกี่ยวข้องกับระบบเครื่องยนต์  จนถึงช่องดักลมคู่หน้าตรงแฟร์ริ่ง  ที่ออกแบบมาให้อากาศเย็นเข้ามายังกล่องอากาศโดยตรงนั่นเองด้วยน้ำหนักรถที่มีน้ำหนัก 487 ปอนด์ และด้วยความพยายามของทางค่ายยักษ์เขียวเอง ที่ต้องการจะทำให้จุดศูนย์ถ่วงอยู่ในตำแหน่งที่พอดี ทำให้ 2014 Kawasaki Z1000 คันนี้เข้าโค้งและเอียงได้ดี โดยคันนี้นั้นมาพร้อมกับระบบการบังคับเลี้ยวที่แม่นยำไม่หักเลี้ยงเร็วจนเกินไป  มุมองศาต่างๆ ของรถก็จะเหมือนกับ เจ้า Kawasaki Ninja 1000 มุม rake ที่ 24.5 และค่าเทรลที่ 4 นิ้ว"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function k3() {
 var h = "ER6N" 
 var p1 =" ER6N ที่มาพร้อมกับเครื่องยนต์ 2 สูบเรียง 649 ซีซี. 4จังหวะ 8 วาล์ว DOHC แบบหัวฉีด ระบายความร้อนด้วยน้ำ แรงบิดจะสูงในรอบต่ำถึงปานกลาง มีอัตราเร่งที่รวดเร็วและยังมีหน้าปัดดีไซน์ใหม่แสดงผลทั้งอะนาล็อคและดิจิตอล ฟังก์ชั่นครับครัน อ่านง่าย สะดวก และมีฟังก์ชั่นแบบที่จะบอกค่าระยะทางที่ขับขี่ได้จากปริมาณเชื้อเพลิงที่เหลืออยู่ และอัตราความสิ้นเปลืองน้ำมันเชื้อเพลิงได้อีกด้วย ABS ที่จะทำให้เบรคได้ดั่งใจไม่สบัดที่มีระบบประมวลผลพัฒนาเพื่อการควบคุมที่แม่นยำมากขึ้น และยังมีขนาดกล่องที่เล็กลงช่วยประหยัดเนื้อที่ในการติดตั้ง สามารถออกแบบเบาะนั่งเพื่อวางเท้าได้ดียิ่งขึ้น และยังมีท่อไอเสียที่ออกแบบโครงสร้างภายในใหม่เพื่อช่วยเครื่องยนต์ที่มีแรงบิดเพิ่มขึ้น ติดใต้เครื่องยนต์ให้จุดศูนย์ถ่วงที่ต่ำ ทำให้ควบคุมและขับขี่ง่ายขึ้น ทั้งยังผ่านค่ามาตรฐานระดับ 6 ของท่อไอเสีย"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function k4() {
 var h = "Z800" 
 var p1 ="Z 800 คันนี้มาพร้อมกับขุมลังแบบ 4 สูบเรียง ความจุ 806 ซีซี DOHC 16 วาล์ว ระบายความร้อนด้วยน้ำ ให้กำลังสูงสุด 113 แรงม้า ที่ 10,200 รอบ/นาที กับแรงบิดอีก 83 นิวตันเมตร ที่ 8000 รอบ/นาที ซึ่งให้สมรรถนะในการขับขี่ช่วงออกตัว ที่รู้สึกว่าคลัชมีน้ำหนักพอประมาณ ไม่แข็งจนเกินไป คือเบากว่าตัว Z1000 แต่ก็ไม่นิ่มเหมือน Ninja300 ที่เพิ่งทดสอบมาล่าสุด โดยใช้เกียร์แบบ Slipper Clutch ที่เข้าเกียร์ได้ง่ายและนุ่มนวล แต่ถ้าเป็นการขับขี่ในช่วงรถติด ก็เล่นเอาเมื่อยนิ้วได้เหมือนกันและเมื่อรอบเครื่องยนต์สูงถึงระดับ 4,000 รอบ/นาที ขึ้นไปจะเริ่มฟังดูลื่นหูเป็นอย่างมาก และเริ่มสัมผัสถึงแรง G ที่มากขึ้นเรื่อยๆ เมื่อรอบยิ่งสูงขึ้นไป"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}
function k5() {
 var h = "Ninja 650" 
 var p1 ="Ninja 650 ABS นั้น ได้ใช้เครื่องยนต์ 4 จังหวะ: 2 สูบ ระบายความร้อนด้วยน้ำ พร้อมทั้งยังมีปริมาตรกระบอกสูบขนาด 649 ซีซี เลยทีเดียว โดดเด่นด้วยระบบวาล์ว DOHC 8 วาล์ว พร้อมทั้งมีขนาดกระบอกสูบ/ช่วงชัก 83 x 60 มม. ทำให้เกิดเป็นความแรงที่เร้าใจอย่างเห็นได้ชัด มีอัตราส่วนการอัด 10.8 :1 ซึ่งพร้อมส่งต่อความสนุก ด้วยระบบเกียร์ 6 เกียร์ ซึ่งตอบโจทย์ความนุ่มนวลได้อย่างยอดเยี่ยม และก็ตอบโจทย์ความรวดเร็วในการเปลี่ยนเกียร์ได้อย่างคล่องตัว Ninja 650 ABS ออกแบบมาให้มีระบบจุดระเบิด Digital CDI ให้ความโดนใจในเรื่องแรงบิดด้วยระบบจ่ายเชื้อเพลิง หัวฉีด 38 มม. x 2 (Keihin) เริ่มต้นสนุกสนาน อย่างเร้าใจ และมีระบบสตาร์ท สตาร์ทไฟฟ้า ทำให้คุณสามารถสตาร์ทได้อย่างง่ายดาย"
document.getElementById("h1").innerHTML = h ;  
document.getElementById("p1").innerHTML = p1 ;
}


